brew "ruby"
brew "wget"
brew "bat"
brew "prettyping"
brew "diff-so-fancy"
brew "tldr"
brew "ncdu"
brew "htop"
brew "git"
brew "git-lfs"
brew "tig"
brew "vim"
brew "micro"
brew "chruby"
brew "ruby-install"
brew "node"
brew "yarn"
tap "heroku/brew"
brew "heroku"
brew "tmux"
brew "fish"
brew "chruby-fish"
brew "pgcli"
brew "fzf"
brew "elixir"
brew "mix-completion"
brew "openssl"
brew "broot"   # Directory tree explorer
brew "terminal-notifier"
brew "exa"

# .NET Core SDK
cask "dotnet-sdk"

# Inspect Docker images
tap "wagoodman/dive"
brew "dive"

# Navi - https://github.com/denisidoro/navi
tap "denisidoro/tools"
brew "navi"

# Game Development
# brew "godot"

# Cask'd Mac apps and stuff
# cask "google-chrome"
cask "atom"
cask "iterm2"
cask "java"
cask "visual-studio-code"
cask "github"
cask "spotify"
cask "alfred"
cask "google-backup-and-sync"
cask "hammerspoon"
cask "homebrew/cask-fonts/font-hack"
cask "homebrew/cask-fonts/font-cascadia"
cask "homebrew/cask-fonts/font-cascadia-mono"
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "homebrew/cask-fonts/font-input"
cask "homebrew/cask-fonts/font-fira-mono"
cask "homebrew/cask-fonts/font-fira-sans"
cask "homebrew/cask-fonts/font-fira-code"
cask "homebrew/cask-fonts/font-fira-code-nerd-font"
cask "homebrew/cask-fonts/font-fira-mono-nerd-font"
cask "homebrew/cask-fonts/font-droidsansmono-nerd-font"
cask "homebrew/cask-fonts/font-pt-mono"
cask "homebrew/cask-fonts/font-office-code-pro"
cask "homebrew/cask-fonts/font-source-code-pro"
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrainsmono-nerd-font"
cask "brogue"
cask "tunnelblick"
cask "eurkey"

# Mac App Store apps
mas "Harvest", id: 506189836
mas "Pocket", id: 568494494
mas "Reeder 3", id: 880001334
mas "Evernote", id: 406056744
mas "1Password 7", id: 1333542190
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "DaisyDisk", id: 411643860
mas "Numbers", id: 409203825
mas "Soulver", id: 413965349
mas "Magnet", id: 441258766
mas "Todoist", id: 585829637
mas "Theine 2", id: 955848755
mas "CCMenu", id: 603117688
