brew "awscli"
brew "awsebcli"
brew "ruby", args: ["with-doc"]
brew "wget"
brew "bat"
brew "prettyping"
brew "diff-so-fancy"
brew "tldr"
brew "ncdu"
brew "htop"
brew "git"
brew "tig"
brew "vim"
brew "micro"
brew "chruby"
brew "ruby-install"
brew "node"
brew "yarn"
tap "heroku/brew"
brew "heroku"
brew "tmux"
brew "bash"
brew "bash-completion"
brew "fish"
brew "chruby-fish"
brew "pgcli"
brew "fzf"
brew "elixir"
brew "mix-completion"
brew "openssl"

# Inspect Docker images
brew "wagoodman/dive/dive"

# Game Development
# brew "godot"

# Cask'd Mac apps and stuff
# cask "google-chrome"
cask "atom"
cask "iterm2"
cask "java"
cask "visual-studio-code"
cask "github"
cask "gitter"
cask "spotify"
cask "caskroom/fonts/font-hack"
cask "caskroom/fonts/font-hack-nerd-font"
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-sans"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-pt-mono"
cask "caskroom/fonts/font-office-code-pro"
cask "caskroom/fonts/font-source-code-pro"
cask "brogue"

# Mac App Store apps
mas "Harvest", id: 506189836
mas "Pocket", id: 568494494
mas "Reeder 3", id: 880001334
mas "Evernote", id: 406056744
mas "1Password 7", id: 1333542190
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "DaisyDisk", id: 411643860
mas "Numbers", id: 409203825
mas "Soulver", id: 413965349
mas "Magnet", id: 441258766
mas "Todoist", id: 585829637
mas "Theine 2", id: 955848755
